{"components":[{"type":"MarkdownEditor","content":{"version":"2.0","text":"## What to expect\n - In most lessons, there will be a **function** (or a few) that is going to be the main subject of the lesson and is going to be tested. \n- We'll **review** the function and show its logic, often line-by-line. \n- The function will serve as a **focus** for the **topic** of the lesson. For example, the \"testing a function that throws\" lesson will have a function that throws and use that to convey how to test such a function.\n- Then, there will be a code playground with the function and its tests.\n- Finally, an Exercise section where a prepared code playground will have a similar function prepared and test file setup for it that you can use to apply what we learned in that lesson.\n- I know that some of the exercises might seem very, very easy and redundant. I promise that you'll get **the most out of this course** if you actually try the exercises!  ","mdHtml":"<h2>What to expect</h2>\n<ul>\n<li>In most lessons, there will be a <strong>function</strong> (or a few) that is going to be the main subject of the lesson and is going to be tested.</li>\n<li>We’ll <strong>review</strong> the function and show its logic, often line-by-line.</li>\n<li>The function will serve as a <strong>focus</strong> for the <strong>topic</strong> of the lesson. For example, the “testing a function that throws” lesson will have a function that throws and use that to convey how to test such a function.</li>\n<li>Then, there will be a code playground with the function and its tests.</li>\n<li>Finally, an Exercise section where a prepared code playground will have a similar function prepared and test file setup for it that you can use to apply what we learned in that lesson.</li>\n<li>I know that some of the exercises might seem very, very easy and redundant. I promise that you’ll get <strong>the most out of this course</strong> if you actually try the exercises!</li>\n</ul>\n","cursorPosition":{"line":0,"ch":0},"comp_id":"-iAXkAQXcl33IZpH6w4Yn","isCopied":true},"saveVersion":16,"mode":"view","iteration":4,"hash":2},{"type":"MarkdownEditor","content":{"version":"2.0","text":"## Requirements \nBasic level JavaScript is something we won't cover in this course. At the same time, basic JavaScript knowledge is required to get the most out of this course.\n\nIf you don't feel confident - consider this JavaScript course https://www.educative.io/courses/javascript-in-detail-from-beginner-to-advanced.\n\n## Let's go!\nOther than that, we'll cover details about unit testing ranging from trivial functions to higher-order functions (functions taking other functions as parameters) to Promises. We'll cover what tools Jasmine affords and how to utilize them.  ","mdHtml":"<h2>Requirements</h2>\n<p>Basic level JavaScript is something we won’t cover in this course. At the same time, basic JavaScript knowledge is required to get the most out of this course.</p>\n<p>If you don’t feel confident - consider this JavaScript course <a href=\"https://www.educative.io/courses/javascript-in-detail-from-beginner-to-advanced\">https://www.educative.io/courses/javascript-in-detail-from-beginner-to-advanced</a>.</p>\n<h2>Let’s go!</h2>\n<p>Other than that, we’ll cover details about unit testing ranging from trivial functions to higher-order functions (functions taking other functions as parameters) to Promises. We’ll cover what tools Jasmine affords and how to utilize them.</p>\n","cursorPosition":{"line":0,"ch":0},"comp_id":"46kYhA2hvRqpGZ4Fls16h"},"iteration":3,"hash":1,"saveVersion":13}],"summary":{"title":"Prerequisites","description":"What can you expect from this course? What prerequisite knowledge would maximize the gain from this course plus some suggestions on other courses.  ","tags":["prerequisites","what to expect"],"titleUpdated":true}}